Revit 2026 API

# SpatialFieldManagerSetMeasurementNames Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetMeasurementNames(
	IList<string> measurementNames
)
```
```vb
Public Sub SetMeasurementNames (
	measurementNames As IList(Of String)
)
```
```cpp
public:
void SetMeasurementNames(
	IList<String^>^ measurementNames
)
```
```fsharp
member SetMeasurementNames :
        measurementNames : IList<string> -> unit
```

#### Parameters

measurementNames IListString

#### Reference

SpatialFieldManager Class

Autodesk.Revit.DB.Analysis Namespace